# Data merge

In [2]:
import pandas as pd

# Example datasets for data merging
# Dataset 1: BANGLADESH Individuals
data1 = {
    'id': [1, 2, 3],
    'name': ['Ahmed', 'Fatima', 'Ali'],
    'age': [28, 32, 24]
}
df1 = pd.DataFrame(data1)
df1.head()

   id    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [3]:
# Dataset 2: Additional Information
data2 = {
    'id': [1, 2, 3],
    'city': ['Dhaka', 'Khulna', 'Chottogram'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}
df2 = pd.DataFrame(data2)
df2.head()

   id        city occupation
0   1       Dhaka   Engineer
1   2      Khulna     Doctor
2   3  Chottogram    Teacher

In [4]:
# Merging DataFrames on 'id'
merged_df = pd.merge(df1, df2, on='id', how='inner')
merged_df.head()

   id    name  age        city occupation
0   1   Ahmed   28       Dhaka   Engineer
1   2  Fatima   32      Khulna     Doctor
2   3     Ali   24  Chottogram    Teacher

---
# Concatenation

In [5]:
import pandas as pd

# Example datasets for Bangladesh context
# Dataset 1 - Bangladesh Names and Ages
data1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'Age': [28, 32, 24]}
# Dataset 2 - More Bangladesh Names and Ages
data2 = {'Name': ['Sara', 'Usman', 'Aisha'], 'Age': [29, 35, 27]}
# Dataset 3 - Cities and Zela in Bangladesh
data3 = {'City': ['Dhaka', 'khulna', 'Chottogram'], 'Zela': ['Uttara', 'Dhanmondi', 'Gulshan']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

# Concatenating Rows
concatenated_rows = pd.concat([df1, df2])

# Concatenating Columns
# Note: For a meaningful column-wise concatenation, dataframes should have the same number of rows.
concatenated_columns = pd.concat([df1, df3], axis=1)
print(concatenated_rows)
print(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
concatenated_columns

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Aisha   27
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

     Name  Age        City       Zela
0   Ahmed   28       Dhaka     Uttara
1  Fatima   32      khulna  Dhanmondi
2     Ali   24  Chottogram    Gulshan